Librerias importadas

In [31]:
import pandas as pd
import matplotlib.pyplot as plt

Importar Dataset

In [32]:
titanic=pd.read_csv("titanic.csv", sep=",")

Exploracion de datos

In [33]:
titanic.head(5)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

Eliminar Columnas

In [34]:
columns_to_drop=["Fare"]
titanic.drop(columns_to_drop, axis="columns", inplace=True)
titanic.head(5)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0
4,0,3,Mr. William Henry Allen,male,35.0,0,0

Renombrar Columnas

In [35]:
print(titanic.columns)

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Siblings/Spouses Aboard',
       'Parents/Children Aboard'],
      dtype='object')

In [36]:
titanic.columns=['Survived', 'Pclass', 'Name', 'Gender', 'Age', 'Siblings','ParCh']
titanic.head(5)

,Survived,Pclass,Name,Gender,Age,Siblings,ParCh
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0
4,0,3,Mr. William Henry Allen,male,35.0,0,0

Resumen del dataSet

In [37]:
print(titanic.shape)

(887, 7)

Tipos de datos

In [38]:
titanic.dtypes

Survived      int64
Pclass        int64
Name         object
Gender       object
Age         float64
Siblings      int64
ParCh         int64
dtype: object